In [1]:
import matplotlib.pyplot as plt
%matplotlib inline
import numpy as np
import os
import pandas as pd
import seaborn as sns
from scipy.integrate import odeint
import random
import time
from datetime import datetime
import sys
import importlib
import functools
import sqlite3
from collections import OrderedDict

print(sys.version)

3.6.7 (default, Feb 28 2019, 07:28:18) [MSC v.1900 64 bit (AMD64)]

In [2]:
now = datetime.now()
print("last run on " + str(now))

tmpSQLPath = r"C:\Users\calli\Desktop\TmpSQL"

if not os.path.exists(tmpSQLPath):
    os.mkdir(tmpSQLPath)

last run on 2019-05-17 14:15:39.434234

In [3]:
tab1 = pd.DataFrame(np.random.rand(3,3), columns= ["Col1", "Col2", "Col3"])
tab1.head()

       Col1      Col2      Col3
0  0.529309  0.142856  0.094092
1  0.662858  0.336135  0.503671
2  0.320586  0.245050  0.273769

In [4]:
tab1 = pd.DataFrame(np.random.rand(3,3), columns= ["Col1", "Col2", "Col3"])
tab1.head()

       Col1      Col2      Col3
0  0.330347  0.203803  0.093609
1  0.273373  0.181913  0.159075
2  0.639538  0.977008  0.844068

In [5]:
tab1 = pd.DataFrame(np.random.rand(3,3), columns= ["Col1", "Col2", "Col3"])
tab1.head()

       Col1      Col2      Col3
0  0.722938  0.582100  0.530395
1  0.040225  0.685206  0.887937
2  0.340414  0.230808  0.426791

In [50]:

con1 = sqlite3.connect(os.path.join(tmpSQLPath, "twoTorqueData.db"))

tab1 = pd.DataFrame(np.random.rand(3,3), columns= ["Col1", "Col2", "Col3"])
# get table names from database
try:
    cursorObj = con1.cursor()
    cursorObj.execute('SELECT name from sqlite_master where type= "table"')
    tableNames = cursorObj.fetchall()
    cursorObj.close()
except:
    print("can't get table names")
    
tab1.to_sql("training_" + str(len(tableNames)).zfill(2), con1, if_exists = "fail", index = False)
    
# close connection
con1.close()

In [51]:
con1 = sqlite3.connect(os.path.join(tmpSQLPath, "twoTorqueData.db"))
cursorObj = con1.cursor()
con1.execute("DROP TABLE IF EXISTS foobar")
con1.execute("DROP TABLE IF EXISTS foobar1")
con1.close()

In [22]:
# get table names in database
con1 = sqlite3.connect(os.path.join(tmpSQLPath, "twoTorqueData.db"))
cursorObj = con1.cursor()
res = cursorObj.execute("SELECT name FROM sqlite_master WHERE type='table';")
tableNames = [name[0] for name in res]
con1.close()
print(tableNames)

['training_04', 'training_05', 'training_06', 'training_07', 'training_08', 'training_09', 'training_10', 'training_11', 'CombinedTraining']

In [53]:

con1 = sqlite3.connect(os.path.join(tmpSQLPath, "twoTorqueData.db"))
con1.execute("DROP TABLE IF EXISTS foobar1")
con1.execute('''CREATE TABLE foobar1 AS 
                SELECT * FROM foofoofoo_00 UNION ALL 
                SELECT * FROM foofoofoo_01 UNION ALL 
                SELECT * FROM foofoofoo_02 
                ''')
con1.close()

In [12]:

con1 = sqlite3.connect(os.path.join(tmpSQLPath, "twoTorqueData.db"))
con1.execute("DROP TABLE IF EXISTS CombinedTraining")
sqlStatement = "CREATE TABLE CombinedTraining AS " + " UNION ALL ".join(["SELECT * FROM " + tableNames[ii] for ii in range(len(tableNames)) if tableNames[ii].startswith("train")])
print(sqlStatement)
con1.execute(sqlStatement)
con1.close()

CREATE TABLE CombinedTraining AS SELECT * FROM training_04 UNION ALL SELECT * FROM training_05 UNION ALL SELECT * FROM training_06 UNION ALL SELECT * FROM training_07 UNION ALL SELECT * FROM training_08 UNION ALL SELECT * FROM training_09 UNION ALL SELECT * FROM training_10 UNION ALL SELECT * FROM training_11

In [13]:
con1.close()

In [15]:
# read in table 
con1 = sqlite3.connect(os.path.join(tmpSQLPath, "twoTorqueData.db"))
inputDat = pd.read_sql_query('''
                            SELECT * FROM combinedTraining
                            ''', 
                            con1)
inputDat

        Col1      Col2      Col3
0   0.659781  0.870053  0.965115
1   0.663873  0.949080  0.358671
2   0.220292  0.895596  0.971828
3   0.332034  0.949383  0.180232
4   0.473184  0.507600  0.997520
5   0.702797  0.324776  0.190576
6   0.993464  0.926708  0.471613
7   0.907636  0.427622  0.375386
8   0.174086  0.345626  0.322837
9   0.965016  0.341177  0.949753
10  0.353118  0.287963  0.809170
11  0.935460  0.099678  0.641967
12  0.347752  0.622717  0.234007
13  0.072750  0.358466  0.949210
14  0.854828  0.697391  0.095448
15  0.737632  0.094728  0.081019
16  0.041406  0.554528  0.292638
17  0.351312  0.745461  0.864056
18  0.248560  0.446407  0.745112
19  0.797824  0.747216  0.207113
20  0.386521  0.900277  0.572696
21  0.188293  0.401408  0.704242
22  0.665359  0.240534  0.612469
23  0.725902  0.422028  0.030500

In [19]:
sqlStatement = "".join(["DROP TABLE IF EXISTS " + tableNames[ii] + "; " for ii in range(len(tableNames)) if tableNames[ii].startswith("foo")])
sqlStatement

'DROP TABLE IF EXISTS foofoofoo_00; DROP TABLE IF EXISTS foofoofoo_01; DROP TABLE IF EXISTS foofoofoo_02; DROP TABLE IF EXISTS foobar1; DROP TABLE IF EXISTS foobar2; '

In [21]:
con1 = sqlite3.connect(os.path.join(tmpSQLPath, "twoTorqueData.db"))
sqlStatement = "".join(["DROP TABLE IF EXISTS " + tableNames[ii] + "; " for ii in range(len(tableNames)) if tableNames[ii].startswith("foo")])
print(sqlStatement)
con1.executescript(sqlStatement)
con1.close()

DROP TABLE IF EXISTS foofoofoo_00; DROP TABLE IF EXISTS foofoofoo_01; DROP TABLE IF EXISTS foofoofoo_02; DROP TABLE IF EXISTS foobar1; DROP TABLE IF EXISTS foobar2;

In [37]:
"CREATE TABLE foobar1 AS " + " UNION ALL ".join(["SELECT * FROM " + tableNames[ii] for ii in range(len(tableNames))])

'CREATE TABLE foobar1 AS SELECT * FROM foofoofoo_00 UNION ALL SELECT * FROM foofoofoo_01 UNION ALL SELECT * FROM foofoofoo_02'